Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t
Struct for a snapped point.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t.Id
ID of the snapped point.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t.Point
The snapped point.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t.HitType
Snapped point hit type.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t.OverrideType
Indicates if snap override was set by the user when snapping.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t.LinePoint1
The first point of the snapped line, if any.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t.LinePoint2
The second point of the snapped line, if any.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t.ReferencePoint
The reference point, if any.